"""내 풀이1
h1, m1, s1 = map(int, input().split(":"))
h2, m2, s2 = map(int, input().split(":"))
t = h2*3600+m2*60+s2 - (h1*3600+m1*60+s1)
if t<0:
    t+=3600*24 #1시간이 3600초 하루는 24시간이니까 하루는 3600*24
print("%02d:%02d:%02d" %(t//3600, (t%3600)//60, t%60))
#print('%02d:%02d:%02d' % ((t//3600)%24, (t//60)%60, t%60)) 이게 더 좋음!!!!
"""
"""다른 사람 풀이 
Ar = []
for i in range(2):
    A, B, C = map(int, input().split(':'))
    Ar.append(A*60*60 + B*60+C)
R = Ar[1] - Ar[0]
print('%02d:%02d:%02d' % ((R//3600) % 24, (R//60) % 60, R % 60))
"""

t = 0
for i in [-1,1]:
    h, m, s = map(int, input().split(":"))
    t += (h*3600+m*60+s)*i
print(t)
print(t//3600)
print('%02d:%02d:%02d' % ((t//3600)%24, (t//60)%60, t%60))
#이게 좋은게 t가 음수여도 나머지가 양수로 나온다!!
#예를 들어서 한 번 해보면 쉽게 이해가 갈꺼다
#10:00:00과 09:00:00을 입력하면 t는 -3600초 이므로 이는 -1시간이다 이를 24로 나눠주면 -1 = 24*(-1)+23이므로 나머지는 23!!이거 좋당!!

"""다른 분 풀이! for문 신박!
b=0
for i in [-1,1]: #이렇게 -1,1일때를 해서 결국 두번쨰초 - 첫번째초 가 된다..!!
    h,m,s=map(int,input().split(":")) 
    b+=(h*3600+m*60+s)*i
if b<0:b+=24*3600
h,b=divmod(b,3600)
m,b=divmod(b,60)
print("%02d:%02d:%02d"%(h,m,b))
"""